In [1]:
import pandas as pd
import numpy as np

In [2]:
df_customer=pd.read_csv("us_customer_data 1.csv")
df_customer.head()

,customer_id,name,email,phone,address,registration_date,loyalty_status
0,1,Michelle Kidd,vayala@example.net,619-723-4258,"USNS Santiago, FPO AE 80872",25-01-2025,Gold
1,2,Brad Newton,taylorcatherine@example.net,537-674-1158,"38783 Oliver Street, West Kristenborough, MT 9...",13-07-2023,Silver
2,3,Larry Torres,dsanchez@example.net,810-256-4505,"6845 Steele Turnpike, West Erikabury, UT 37487",18-08-2023,Bronze
3,4,Kimberly Price,jessicaknight@example.com,423-222-9779,"1631 Alexis Meadows, Lake Amanda, CA 75179",08-12-2024,Gold
4,5,Matthew Phillips,qwilliams@example.com,220-763-3522,"2274 Williams Heights Suite 895, Andersonhaven...",03-02-2024,Gold

In [3]:
df_customer.describe()

       customer_id
count  1000.000000
mean    500.500000
std     288.819436
min       1.000000
25%     250.750000
50%     500.500000
75%     750.250000
max    1000.000000

In [4]:
df_customer.columns

Index(['customer_id', 'name', 'email', 'phone', 'address', 'registration_date',
       'loyalty_status'],
      dtype='object')

In [5]:
df_customer.isna().sum()

customer_id           0
name                  0
email                50
phone                16
address               0
registration_date     0
loyalty_status        0
dtype: int64

In [6]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        1000 non-null   int64
 1   name               1000 non-null   object
 2   email              950 non-null    object
 3   phone              984 non-null    object
 4   address            1000 non-null   object
 5   registration_date  1000 non-null   object
 6   loyalty_status     1000 non-null   object
dtypes: int64(1), object(6)
memory usage: 54.8+ KB

In [7]:
df_customer[0:5]

,customer_id,name,email,phone,address,registration_date,loyalty_status
0,1,Michelle Kidd,vayala@example.net,619-723-4258,"USNS Santiago, FPO AE 80872",25-01-2025,Gold
1,2,Brad Newton,taylorcatherine@example.net,537-674-1158,"38783 Oliver Street, West Kristenborough, MT 9...",13-07-2023,Silver
2,3,Larry Torres,dsanchez@example.net,810-256-4505,"6845 Steele Turnpike, West Erikabury, UT 37487",18-08-2023,Bronze
3,4,Kimberly Price,jessicaknight@example.com,423-222-9779,"1631 Alexis Meadows, Lake Amanda, CA 75179",08-12-2024,Gold
4,5,Matthew Phillips,qwilliams@example.com,220-763-3522,"2274 Williams Heights Suite 895, Andersonhaven...",03-02-2024,Gold

In [8]:
df_customer.loc[0,'customer_id']

np.int64(1)

In [9]:
df_customer.loc[[0],['customer_id','name','email']]

   customer_id           name               email
0            1  Michelle Kidd  vayala@example.net

In [10]:
df_customer.iloc[0:5]['loyalty_status']

0      Gold
1    Silver
2    Bronze
3      Gold
4      Gold
Name: loyalty_status, dtype: object

In [11]:
df1=df_customer.set_index('loyalty_status').head()

In [12]:
df1.loc[['Gold'],['customer_id','name']]

                customer_id              name
loyalty_status
Gold                      1     Michelle Kidd
Gold                      4    Kimberly Price
Gold                      5  Matthew Phillips

In [13]:
for i in df_customer.columns:
    print(i)

customer_id
name
email
phone
address
registration_date
loyalty_status

In [14]:
df_customer.drop(['address','phone'],axis=1).head()

,customer_id,name,email,registration_date,loyalty_status
0,1,Michelle Kidd,vayala@example.net,25-01-2025,Gold
1,2,Brad Newton,taylorcatherine@example.net,13-07-2023,Silver
2,3,Larry Torres,dsanchez@example.net,18-08-2023,Bronze
3,4,Kimberly Price,jessicaknight@example.com,08-12-2024,Gold
4,5,Matthew Phillips,qwilliams@example.com,03-02-2024,Gold

In [15]:
df_customer['loyalty_status'].nunique()

3